---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldPrefix
source: html/b66fda82-634c-f3fa-440d-6604f6453bfd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldPrefix Property

"Prefix"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldPrefix { get; }
```